cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'awscli'
brew 'exa'
brew 'git'
brew 'go'
brew 'jq'
brew 'node'
brew 'openssl'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'authy'
cask 'caffeine'
cask 'clipy'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'keybase'
cask 'iterm2'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'


# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'







 






