cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
brew 'curl'
brew 'grep'

# Install Binaries
brew 'awscli' # AWS CLI
brew 'bat' # cat with wings
brew 'cheat' # cheat sheets
brew 'curlie' # curl
brew 'dog' # DNS
brew 'duf' # disk usage
brew 'fd'  # find
brew 'gh' # GitHub CLI
brew 'git' # Git
brew 'gnupg' # GPG
brew 'go'
brew 'helm'
brew 'jq'
brew 'kubectl'
brew 'lsd' # ls with icons
brew 'openssh'
brew 'pinentry' # GPG
brew 'pinentry-mac'
brew 'pipenv' # Python virtualenv
brew 'pyenv' # Python version manager
brew 'pyenv-virtualenv' # Python virtualenv
brew 'tfenv' #
brew 'tmux'
brew 'tree' #
brew 'vim' #
brew 'wget'
brew 'zoxide' # smarter cd

# Apps
cask '1password'
cask 'arc'
cask 'clipy'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
# cask 'google-cloud-sdk'
cask 'iterm2'
cask 'obsidian'
cask 'pycharm-ce'
cask 'rectangle'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoomus'

# # Fonts
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'







 






